[
  {
    "id": "445e4d12-d1e2-4d67-bde0-069fee9098e1",
    "name": "Snow Report 2026-02-16 16:07:48",
    "date": "2026-02-16 16:07:48",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Good afternoon, Beast fans,</p><p>What a day it turned out to be. Comfortable temps, just a soft breeze, great visibility, and wall-to-wall terrain made for a fantastic President’s Day on snow. We’re rolling right through holiday week with prime midwinter conditions across the most open terrain in the East.</p><p>Temperatures continue to moderate tonight, holding in the 20s, and tomorrow will bring mostly cloudy skies with highs in the mid to upper 20s up top and low 30s at the base. Winds will be on the lighter side, generally 10–15 mph out of the west. There’s a chance for light, showery precipitation during the day, mainly snow, with a brief mix possible at lower elevations. Nothing impactful, and the slightly warmer temps should help surfaces soften up nicely through the afternoon.</p><p>Snow surfaces remain in a really good place. Groomed terrain continues to offer that smooth, carve-friendly packed powder feel, with a few isolated slick spots here and there. With moderating temps, expect a little more give under your edges tomorrow while still holding onto that classic Beast bite.</p><p>Our grooming team is sticking with the same plan as last night with a few adjustments. Lower Double Dipper, Downdraft, and Lower Pipe Dream will come off the grooming plan, so those areas may start to bump up for anyone looking to mix in some natural terrain. Superstar has been added to the grooming lineup as crews begin flattening out the snowmaking whales while continuing to build toward spring. Just a reminder, Launchpad as it crosses Superstar, will be for advanced skiers and riders only again tomorrow due to snowmaking efforts. If you're looking to plan your day tomorrow, check out our <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\">Lifts &amp; Trails Report</a> for all the latest.</p><p>Snowmaking operations are currently on hold with the warmer temperatures. If colder weather returns later this week, we could see guns fire back up. If you’re curious to learn more about snowmaking and the natural challenges our crew has faced this winter, take a look at our most recent <a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.</p><p>Tomorrow, lifts are scheduled to spin at 9:00 a.m., with the South Ridge Quad opening at 10:00 a.m. In addition to our regular Tuesday lineup, lifts like the Bear Mountain Quad, South Ridge Quad, and Canyon Quad will be running, giving you even more terrain to explore.</p><p>Looking ahead, there are multiple additional chances for snow later this week and into the weekend, enough to keep things fresh as we move deeper into February.</p><p>The <a href=\"https://www.killington.com/things-to-do/activities/tubing-park/\">Tubing Park presented by bubly</a> remains open daily from 10:00 a.m. to 6:00 p.m.</p><p>Over in kparks, the lineup stays stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with its wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features and a halfpipe, and Easy Street, Lil’ Stash, and Vale Yard are all dialed.</p><p>Another strong stretch of winter at The Beast. We’ll see you out there.</p><p>-Josh</p><p>&nbsp;</p><p><strong>Operating Day: 98</strong></p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\">here</a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\">here</a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge&nbsp;</strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge&nbsp;</strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">Click here</a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\">here</a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\">Ministars</a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 11:00 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt –&nbsp;</strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\">Reservations</a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong>Killington Sports</strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\">Killington Lift Tickets</a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\">Online Pass Checker</a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\">here</a>.  &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\">Buy now</a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\">802-523-2202</a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\">1-800-621-MTNS</a> or email <a href=\"mailto:seasonpass@killington.com\">seasonpass@killington.com</a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\">Killington.com/cancellation</a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it&nbsp;</strong><a href=\"https://form.jotform.com/243283973021051\"><strong>here.</strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771273769,
    "updated": 1771293233,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "106f90d0-657a-49d7-8576-6bbe7ddbb2ed",
    "name": "Snow Report 2026-02-16 05:49:46",
    "date": "2026-02-16 05:49:46",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Good morning, Beast fans,</p><p>We’re rolling into President’s Day with prime midwinter conditions across the most open terrain in the East. A flurry or two is possible early this morning, but clouds will decrease through the day with some sun breaking out this afternoon.</p><p>Temperatures will feel comfortable for this time of year, especially compared to the deep cold we saw earlier this month. Look for highs in the mid-20s up top and upper-20s at the base, with a light south breeze around 10–15 mph. It’s classic Vermont winter, crisp, manageable, and ideal for long laps.</p><p>Snow surfaces remain in a really good place. Groomed terrain is delivering that smooth, carve-friendly packed powder feel by the afternoon, with a few isolated slick spots here and there. Expect fresh machine-groomed corduroy this morning, with the potential for a little softening this afternoon as temps moderate and the sun works through.</p><p>Our grooming team is sticking with the same plan as last night, minus Outer Limits, which will ski on natural snow today (enjoy those bumps!). With 100% of trails open, you’ve got options everywhere, from money turns on Bunny Buster and Double Dipper to steeper lines across Skye Peak. To help plan your day, check out our <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\">Lifts &amp; Trails Report</a> for all the latest.</p><p>Holiday lift hours are in effect. All lifts will be running today with key lifts starting to spin at 8:00 a.m. Head over to South Ridge for a sweet morning cruise down Pipe Dream, prime for lapping when the South Ridge Quad starts spinning at 9:00 a.m.</p><p>Snowmaking continues around the K-1 base area and lower Superstar, with spot guns in the middle of Snowdon. Most of Devil’s Fiddle is coming offline, though the bottom section will continue to receive attention. Surfaces near active snowmaking may be variable, so please stay alert in those zones.</p><p>A quick reminder: the whales on Superstar are building, and skiing &amp; riding across Launch Pad on Superstar is currently for expert guests only. If you’re looking for a smoother route down, follow the Peak to Creek emblems and stay on Bear Trax.</p><p>If you’re curious to learn more about snowmaking and the natural challenges our crew has faced this winter, take a look at our most recent <a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.</p><p>Looking ahead, we may see a light refresh of a couple of inches over the next few days, just enough to keep things interesting. Think snow!</p><p>The <a href=\"https://www.killington.com/things-to-do/activities/tubing-park/\">Tubing Park presented by bubly</a> is open from 10:00 a.m. to 6:00 p.m. today, offering another great way to keep the holiday fun going.</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash is fully in play with its wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash and Vale Yard remain dialed.</p><p>Another strong winter day at The Beast. Enjoy the sun and comfortable temps, and we’ll see you out there!</p><p>-Josh</p><p>&nbsp;</p><p><strong>Operating Day: 97</strong></p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\">here</a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\">here</a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge&nbsp;</strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge&nbsp;</strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">Click here</a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\">here</a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\">Ministars</a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 11:00 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt –&nbsp;</strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\">Reservations</a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong>Killington Sports</strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\">Killington Lift Tickets</a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\">Online Pass Checker</a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\">here</a>.  &nbsp;&nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\">Buy now</a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\">802-523-2202</a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\">1-800-621-MTNS</a> or email <a href=\"mailto:seasonpass@killington.com\">seasonpass@killington.com</a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\">Killington.com/cancellation</a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it&nbsp;</strong><a href=\"https://form.jotform.com/243283973021051\"><strong>here.</strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771239708,
    "updated": 1771260334,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "a724da05-8395-4911-9d17-183f64a09b1c",
    "name": "Snow Report 2026-02-15 16:00:53",
    "date": "2026-02-15 16:00:53",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>How are we Beast Fam?&nbsp;</p><p>A gorgeous bluebird day on the slopes was just what we needed. This weekend has been a blast so far and we’re still firing into Presidents Day. This is winter at Killington in its prime as 100% of our trails are open to shred and we are leading the East in terrain.&nbsp;</p><p>Expect a mostly cloudy day on Washington’s Birthday, with a slight chance of snow showers early tomorrow morning before things settle in. Temps will top out near 30° at the base and 23° near the top, with a steady south wind around 10–15 mph. It’s classic Vermont conditions so get after it.</p><p>Despite the beautiful sun beating down on the mountain and perfect temps keeping us happy, the quality of our snow surfaces has not taken a hit at all. Devils Fiddle has been on point and I’ve heard some say it was their run of the year so far. Now that’s some seriously good shredding. You obviously can't go wrong with the terrain at Bear Mountain, and Skyeburst is a great run to cruise on just nearby. All of our lifts will be running tomorrow with key lifts starting to spin at 8:00 a.m. Head over to South Ridge for a sweet morning cruise down Pipe Dream, prime for lapping when the South Ridge Quad starts spinning at 9:00 a.m.</p><p>Our grooming team is after it again, covering 96 trials with flush corduroy. They’ll be tackling the same plan minus Outer Limits which will be skiing on natural tomorrow. Groomers are still skiing incredibly well so pick your choice from the <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\">Lifts &amp; Trails Report</a> and have a blast carving it up. Some of my favorite picks are Bunny Buster and Double Dipper for those money turns.&nbsp;</p><p>Our snowmaking crews will be lighting up snowguns around the K-1 base area and lower Superstar, with spot guns on the middle of Snowdon. Most of Devils Fiddle will be coming offline besides the bottom section which will get some more attention after temps required a break. The snow can be variable near snowmaking so please take note of that when skiing &amp; riding near those areas. If you are curious to learn more about snowmaking and the natural challenges our crew has faced this winter, take a look at our most recent&nbsp;<a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.&nbsp;&nbsp;</p><p>A quick note related to snowmaking: the whales on Superstar are getting quite large, and skiing &amp; riding on Launch Pad across Superstar is currently for expert skiers and riders only. If you want an easier cruising route, follow our Peak to Creek emblems on our trail signs and stay on Bear Trax.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride. In our Vale Yard Park, we're still rocking the Park Affair build from last weekend, featuring 9 features and jumps in total from XS to M difficulty.&nbsp;</p><p>The <a href=\"https://www.killington.com/things-to-do/activities/tubing-park/\">Tubing Park presented by bubly</a> will open at 10:00 a.m. and will run until 6:00 p.m. this week, offering another great way to keep the fun going off the slopes.</p><p>We’re still rolllin’ and I’ll see you out there!</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 97</strong></p><p><em>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.</em>&nbsp;&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\"><u>here</u></a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\"><u>here</u></a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge </strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge </strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\"><u>Click here</u></a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\"><u>here</u></a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\"><u>Ministars</u></a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt – </strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\"><u>Reservations</u></a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong><u>Killington Sports</u></strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\"><u>Killington Lift Tickets</u></a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\"><u>Online Pass Checker</u></a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\"><u>here</u></a>. &nbsp; &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\"><u>Buy now</u></a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\"><u>802-523-2202</u></a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\"><u>1-800-621-MTNS</u></a> or email <a href=\"mailto:seasonpass@killington.com\"><u>seasonpass@killington.com</u></a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\"><u>Killington.com/cancellation</u></a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it </strong><a href=\"https://form.jotform.com/243283973021051\"><strong><u>here.</u></strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771189081,
    "updated": 1771189667,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "13e54fb8-e1d6-43d2-819b-5ba155a796cb",
    "name": "Snow Report 2026-02-15 05:43:06",
    "date": "2026-02-15 05:43:06",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Morning, Beast fans!</p><p>The weekend is off to a stellar start as we carve up good snow and catch up with the games slopeside. Mother Nature showed us some love yesterday with snowflakes and perfect temps to be enjoying what the outdoors have to offer at the Beast. It’s a great time to be here as we’re still 100% open and leading the East. If you haven’t swung by yet, our newly renovated Superstar Beach Bar is open and serving beverages just a short slide away from the Superstar Six lift.&nbsp;</p><p>Mostly sunny skies will greet us today with a high near 28° at the base and 21° at the peak. North winds will hover around 28 to 33 mph making it feel a little colder before calming down later in the day.&nbsp;</p><p>The surfaces on snow are behaving very nicely, with lots of packed powder and soft moguls, with just a few areas of hardpack. Grooming will help mitigate that, and they’ve been doing such a good job that some have labeled them as magicians, and I can’t disagree. Cruise Control is still a blast to lap with the crew and Ovation will be open on natural as that trail has been riding really well. I’d head over to Bear for some warmup runs on Bear Claw and if you’re feeling it, some inclined carving on Outer Limits.&nbsp;</p><p>Our grooming team worked the mountain from top to bottom and side to side, reaching an impressive 96 trails. They’ve added Outer Limits, Spacewalk, Dream Maker Headwall, Lower Vertigo, and more. As you know, you can’t go wrong with any of our smoothed trails and for a complete list, check out our <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\">Lifts &amp; Trails Report</a> to plan your sessions.&nbsp;</p><p>Our snowmakers are still intensely focusing their muscle on Devils Fiddle and Superstar. After a few days of blasting over fifty guns, the Fiddle will have a nice addition to its base, and our crew will move on to the next mission come Monday. If you are curious to learn more about snowmaking and the natural challenges our crew has faced this winter, take a look at our most recent&nbsp;<a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.&nbsp;&nbsp;</p><p>A quick note related to snowmaking: the whales on Superstar are getting quite large, and skiing &amp; riding on Launch Pad across Superstar is currently for expert skiers and riders only. If you want an easier cruising route, follow our Peak to Creek emblems on our trail signs and stay on Bear Trax.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride. In our Vale Yard Park, we're still rocking the Park Affair build from last weekend, featuring 9 features and jumps in total from XS to M difficulty.&nbsp;</p><p>If you want to catch some of the winter games during your lodge breaks this weekend, head to the&nbsp;K-1 Lodge patio. All day today, February 15th, you’re invited to join us at our <a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">Winter Olympic Games Milano Cortina 2026 Watch Party</a>, proudly sponsored by the Official Team USA Beer Sponsor, Michelob ULTRA. Coverage of the winter games will be playing all day long on TV screens just outside the lodge, with special Michelob ULTRA activations taking place during the USA Men’s Hockey games at 3:00 p.m.</p><p>As a last heads up, the Mountain G.O.A.T. will be offering complimentary shuttle service (as available) around our K-1, Ramshead, and Snowshed base areas today. We will also be offering our regularly scheduled <a href=\"https://www.killington.com/the-mountain/getting-here/base-area-parking/\">Base Area Transportation Shuttles</a> all throughout the weekend.&nbsp;</p><p>There’s still more fun to be had!&nbsp;</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 96</strong>&nbsp;</p><p><em>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.</em>&nbsp;&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\"><u>here</u></a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\"><u>here</u></a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge </strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge </strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\"><u>Click here</u></a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\"><u>here</u></a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\"><u>Ministars</u></a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt – </strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\"><u>Reservations</u></a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong><u>Killington Sports</u></strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\"><u>Killington Lift Tickets</u></a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\"><u>Online Pass Checker</u></a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\"><u>here</u></a>. &nbsp; &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\"><u>Buy now</u></a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\"><u>802-523-2202</u></a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\"><u>1-800-621-MTNS</u></a> or email <a href=\"mailto:seasonpass@killington.com\"><u>seasonpass@killington.com</u></a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\"><u>Killington.com/cancellation</u></a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it </strong><a href=\"https://form.jotform.com/243283973021051\"><strong><u>here.</u></strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771152426,
    "updated": 1771152495,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "c71d3e42-351f-45c5-a4e3-9a7aff02d2b2",
    "name": "Snow Report 2026-02-14 16:05:54",
    "date": "2026-02-14 16:05:54",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Happy Valentine’s Day!&nbsp;</p><p>The weekend is off to a stellar start as we carve up good snow and catch up with the games slopeside. Mother Nature showed us some love with snowflakes and perfect temps to be enjoying what the outdoors have to offer at the Beast. It’s a great time to be here as we’re still 100% open and leading the East. If you haven’t swung by yet, our newly renovated Superstar Beach Bar is open and serving beverages just a short slide away from the Superstar Six lift.&nbsp;</p><p>Mostly sunny skies will greet us tomorrow with a high near 28° at the base and 21° at the peak. North winds will hover around 28 to 33 mph making it feel a little colder before calming down later in the day.&nbsp;</p><p>The surfaces on snow are behaving very nicely, with lots of packed powder and soft moguls, with just a few areas of hardpack. Grooming will help mitigate that, and they’ve been doing such a good job that some have labeled them as magicians, and I can’t disagree. Cruise Control is still a blast to lap with the crew and Ovation will be open on natural as that trail has been riding really well. I’d head over to Bear for some warmup runs on Bear Claw and if you’re feeling it, some inclined carving on Outer Limits.&nbsp;</p><p>Our grooming team will be working the mountain from top to bottom and side to side, reaching an impressive 96 trails. They’re adding Outer Limits, Spacewalk, Dream Maker Headwall, and more. As you know, you can’t go wrong with any of our smoothed trails and for a complete list, check out our <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\">Lifts &amp; Trails Report</a> to plan your sessions.&nbsp;</p><p>Our snowmakers are still intensely focusing their muscle on Devils Fiddle and Superstar. After a few days of blasting over fifty guns, the Fiddle will have a nice addition to its base, and our crew will move on to the next mission come Monday. If you are curious to learn more about snowmaking and the natural challenges our crew has faced this winter, take a look at our most recent&nbsp;<a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.&nbsp;&nbsp;</p><p>A quick note related to snowmaking: the whales on Superstar are getting quite large, and skiing &amp; riding on Launch Pad across Superstar is currently for expert skiers and riders only. If you want an easier cruising route, follow our Peak to Creek emblems on our trail signs and stay on Bear Trax.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride. In our Vale Yard Park, we're still rocking the Park Affair build from last weekend, featuring 9 features and jumps in total from XS to M difficulty.&nbsp;</p><p>If you want to catch some of the winter games during your lodge breaks this weekend, head to the&nbsp;K-1 Lodge patio. All day on Sunday, February 15th, you’re invited to join us at our <a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">Winter Olympic Games Milano Cortina 2026 Watch Party</a>, proudly sponsored by the Official Team USA Beer Sponsor, Michelob ULTRA. Coverage of the winter games will be playing all day long on TV screens just outside the lodge, with special Michelob ULTRA activations taking place during the USA Men’s Hockey games at 3:00 p.m.</p><p>Tomorrow morning, we’re hosting a&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\"><u>watch party for Mikaela Shiffrin</u></a> during her Women’s Giant Slalom run on the 3rd floor of our K-1 Lodge. Tickets are currently sold out, but you can still find links to donate directly or bid on exclusive Mikaela Shiffrin auction items by <a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\"><u>clicking here</u></a>, with all proceeds benefitting the Share Winter Foundation.&nbsp;</p><p>As a last heads up, the Mountain G.O.A.T. will be offering complimentary shuttle service (as available) around our K-1, Ramshead, and Snowshed base areas on Sunday. We will also be offering our regularly scheduled <a href=\"https://www.killington.com/the-mountain/getting-here/base-area-parking/\">Base Area Transportation Shuttles</a> all throughout the weekend.&nbsp;</p><p>There’s still more fun to be had!&nbsp;</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 96</strong>&nbsp;</p><p><em>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.</em>&nbsp;&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\"><u>here</u></a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\"><u>here</u></a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge </strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge </strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\"><u>Click here</u></a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\"><u>here</u></a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\"><u>Ministars</u></a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt – </strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\"><u>Reservations</u></a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong><u>Killington Sports</u></strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\"><u>Killington Lift Tickets</u></a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\"><u>Online Pass Checker</u></a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\"><u>here</u></a>. &nbsp; &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\"><u>Buy now</u></a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\"><u>802-523-2202</u></a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\"><u>1-800-621-MTNS</u></a> or email <a href=\"mailto:seasonpass@killington.com\"><u>seasonpass@killington.com</u></a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\"><u>Killington.com/cancellation</u></a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it </strong><a href=\"https://form.jotform.com/243283973021051\"><strong><u>here.</u></strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771103526,
    "updated": 1771104229,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "d3f80441-d61d-4d79-a5a8-a640fa75daa0",
    "name": "Snow Report 2026-02-14 05:48:34",
    "date": "2026-02-14 05:48:34",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>What’s up, Beast fans?&nbsp;</p><p>Today is Valentine’s Day, and we’re happy to be feeling the love&nbsp;from Mother Nature as of late. After 8” of snow in the last week, we’ve been treated to sunny blue skies for the last two days, and this weekend’s forecast is calling for both some sun and some snow. It’s shaping up to be a gorgeous weekend at The Beast, full of winter games watch parties and fantastic turns on our 100% open terrain.&nbsp;</p><p>The weather looks friendly, with highs around 27° at the base and close to 20° at the peak. Winds will stay pretty calm at the base and will gust a little bit higher at the top of lifts, but nothing out of the ordinary there. We’ll see mostly cloud cover with some snow showers looking to roll through during the day. Friendly reminder that our Bear Mountain Quad is slated to open at 7:30 a.m. for anyone looking to get first tracks!&nbsp;</p><p>Snow conditions have continued to be excellent of late and today should be no different. Cover is holding up nicely in the woods while groomers have been top-notch. If you want to find a good line no matter what, head to one of our wide cruisers—Cruise Control, Upper Double Dipper, and Needles Eye always deliver the goods. Upper Pipe Dream was also excellent yesterday, and Outer Limits was a fun challenge after it received a groom on Thursday night.&nbsp;By day’s end, conditions may start turning into loose granular near the center of more our popular trails, but there’s good snow to be found just about everywhere you look. &nbsp;</p><p>Our grooming team tackled an ambitious plan, upping our groomed trail count to almost 100! A few highlights: essentially all our trails in the Canyon got groomed, as well as all of Ovation, Field Goal, and Racers Edge. Old Superstar and Touchdown saw a smooth recently, but conditions on both are holding up just fine. For the full rundown, take a look at our <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\">Lifts &amp; Trails Report</a>. &nbsp;</p><p>On the snowmaking front, our plan is to keep the snowguns on Devil’s Fiddle, Superstar, and certain spot guns largely around our base areas through Sunday night/Monday morning. Shout out (as always) to our snowmaking team for lighting up Devil’s Fiddle once again this season! While you may not see much snowmaking in other places, we’re still running comfortably over 100 snowguns here in mid-February. Interested to know why making snow has been doubly hard this season even though&nbsp;it’s&nbsp;been so cold? Check out our latest&nbsp;<a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.&nbsp;&nbsp;</p><p>A quick note related to snowmaking: the whales on Superstar are getting quite large, and skiing &amp; riding on Launch Pad across Superstar is currently for expert skiers and riders only. If you want an easier cruising route, follow our Peak to Creek emblems on our trail signs and stay on Bear Trax.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride. In our Vale Yard Park, we're still rocking the Park Affair build from last weekend, featuring 9 features and jumps in total from XS to M difficulty.&nbsp;</p><p>If you want to catch some of the winter games during your lodge breaks this weekend, head to the&nbsp;K-1 Lodge patio. All day today and on Sunday, February 15th, you’re invited to join us at our <a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">Winter Olympic Games Milano Cortina 2026 Watch Party</a>, proudly sponsored by the Official Team USA Beer Sponsor, Michelob ULTRA. Coverage of the winter games will be playing all day long on TV screens just outside the lodge, with special Michelob ULTRA activations taking place during the USA Men’s Hockey games at 3:00 p.m. today and Sunday.&nbsp;</p><p>As a last heads up, the Mountain G.O.A.T. will be offering complimentary shuttle service (as available) around our K-1, Ramshead, and Snowshed base areas on Saturday and Sunday. We will also be offering our regularly scheduled <a href=\"https://www.killington.com/the-mountain/getting-here/base-area-parking/\">Base Area Transportation Shuttles</a> all throughout the weekend.&nbsp;</p><p>Let's have a day!</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 95</strong>&nbsp;</p><p><em>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.</em>&nbsp;&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\"><u>here</u></a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\"><u>here</u></a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge </strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge </strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\"><u>Click here</u></a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\"><u>here</u></a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\"><u>Ministars</u></a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt – </strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\"><u>Reservations</u></a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong><u>Killington Sports</u></strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\"><u>Killington Lift Tickets</u></a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\"><u>Online Pass Checker</u></a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\"><u>here</u></a>. &nbsp; &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\"><u>Buy now</u></a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\"><u>802-523-2202</u></a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\"><u>1-800-621-MTNS</u></a> or email <a href=\"mailto:seasonpass@killington.com\"><u>seasonpass@killington.com</u></a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\"><u>Killington.com/cancellation</u></a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it </strong><a href=\"https://form.jotform.com/243283973021051\"><strong><u>here.</u></strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771066497,
    "updated": 1771081033,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "6699c364-9bc9-4f49-be16-61c816cfba71",
    "name": "Snow Report 2026-02-13 16:33:02",
    "date": "2026-02-13 16:33:02",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>What’s up, Beast fans?&nbsp;</p><p>Tomorrow is Valentine’s Day, and we’re happy to be feeling the love&nbsp;from Mother Nature as of late. After 14” of snow in the last week, we’ve been treated to sunny blue skies for the last two days, and this weekend’s forecast is calling for both some sun and some snow. It’s shaping up to be a gorgeous weekend at The Beast, full of winter games watch parties and fantastic turns on our 100% open terrain.&nbsp;</p><p lang=\"EN-US\">The weather tomorrow looks friendly, with highs around 27° at the base and close to 20° at the peak. Winds will stay pretty calm at the base and will gust a little bit higher at the top of lifts, but nothing out of the ordinary there. We’ll see mostly cloud cover with some snow showers looking to roll through during the day. Friendly reminder that our Bear Mountain Quad is slated to open at 7:30 a.m. tomorrow for anyone looking to get first tracks!&nbsp;</p><p lang=\"EN-US\">Snow conditions have continued to be excellent of late and tomorrow should be no different. Cover is holding up nicely in the woods while groomers have been top-notch. If you want to find a good line no matter what, head to one of our wide cruisers—Cruise Control, Upper Double Dipper, and Needles Eye always deliver the goods. Upper Pipe Dream was also excellent today, and Outer Limits was a fun challenge after it received a groom on Thursday night.&nbsp;By day’s end, conditions may start turning into loose granular near the center of busier trails, but there’s good snow to be found just about everywhere you look. &nbsp;</p><p lang=\"EN-US\">Our grooming team is tackling an ambitious plan tonight, upping our groomed trail count to almost 100 heading into tomorrow! A few highlights: essentially all our trails in the Canyon are getting groomed, as well as all of Ovation, Field Goal, and Racer’s Edge (if time allows). Old Superstar and Touchdown saw a groom last night, but conditions on both are holding up just fine heading into tomorrow. For the full rundown, take a look at our <a href=\"https://www.killington.com/the-mountain/conditions-weather/lifts-trails-report/\"><u>Lifts &amp; Trails Report</u></a>. &nbsp;</p><p lang=\"EN-US\">On the snowmaking front, our plan is to keep the snowguns on Devil’s Fiddle, Superstar, and certain spot guns largely around our base areas through Sunday night/Monday morning. Shout out (as always) to our snowmaking team for lighting up Devil’s Fiddle once again this season! While you may not see much snowmaking in other places, we’re still running comfortably over 100 snowguns here in mid-February. Interested to know why making snow has been doubly hard this season even though&nbsp;it’s&nbsp;been so cold? Check out our latest&nbsp;<a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\"><u>Insider Blog</u></a>.&nbsp;&nbsp;</p><p lang=\"EN-US\">A quick note related to snowmaking: the whales on Superstar are getting quite large, and skiing &amp; riding on Launch Pad across Superstar is currently for expert skiers and riders only. If you want an easier cruising route, follow our Peak to Creek emblems on our trail signs and stay on Bear Trax.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride. In our Vale Yard Park, we're still rocking the Park Affair build from last weekend, featuring 9 features and jumps in total from XS to M difficulty.&nbsp;</p><p>If you want to catch some of the winter games during your lodge breaks this weekend, head to the&nbsp;K-1 Lodge patio. All day on Saturday, February 14th and Sunday, February 15th, you’re invited to join us at our <a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\"><u>Winter Olympic Games Milano Cortina 2026 Watch Party</u></a>, proudly sponsored by the Official Team USA Beer Sponsor, Michelob ULTRA. Coverage of the winter games will be playing all day long on TV screens just outside the lodge, with special Michelob ULTRA activations taking place during the USA Men’s Hockey games at 3:00 p.m. on both Saturday and Sunday.&nbsp;</p><p>On Sunday morning, we’re hosting a&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\"><u>watch party for Mikaela Shiffrin</u></a> during her Women’s Giant Slalom run on the 3rd floor of our K-1 Lodge. Tickets are currently sold out, but you can still find links to donate directly or bid on exclusive Mikaela Shiffrin auction items by <a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\"><u>clicking here</u></a>, with all proceeds benefitting the Share Winter Foundation.&nbsp;</p><p>As a last heads up, the Mountain G.O.A.T. will be offering complimentary shuttle service (as available) around our K-1, Ramshead, and Snowshed base areas on Saturday and Sunday. We will also be offering our regularly scheduled <a href=\"https://www.killington.com/the-mountain/getting-here/base-area-parking/\"><u>Base Area Transportation Shuttles</u></a> all throughout the weekend.&nbsp;</p><p lang=\"EN-US\">Rest up and get after it tomorrow!&nbsp;</p><p lang=\"EN-US\">- Cullen&nbsp;</p><p lang=\"EN-US\">&nbsp;</p><p><strong>Operating Day: 95</strong>&nbsp;</p><p><em>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.</em>&nbsp;&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.&nbsp;</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong> </li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong> </li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong> </li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong> </li><li>Pico Base to Pico Summit - <strong>Open</strong> </li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp; &nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\"><u>here</u></a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/\"><u>here</u></a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge </strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts. </li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp; &nbsp;</li></ul><p><strong>Snowshed Lodge </strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily. </li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m. </li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m. </li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\"><u>Click here</u></a> for more information. </li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\"><u>here</u></a>.&nbsp; &nbsp;</li></ul><p><strong>Ramshead Lodge </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday. </li><li>Rentals at Ramshead are open for youth lesson participants and families only. </li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\"><u>Ministars</u></a> program meet at Ramshead. </li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp; &nbsp;</li></ul><p><strong>Bear Mountain </strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp; &nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp; &nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp; &nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp; &nbsp;</p><p><strong>Ledgewood Yurt – </strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\"><u>Reservations</u></a> recommended.&nbsp; &nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong><u>Killington Sports</u></strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp; &nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;&nbsp;</p><p>&nbsp; &nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\"><u>Killington Lift Tickets</u></a>.&nbsp; &nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\"><u>Online Pass Checker</u></a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\"><u>here</u></a>. &nbsp; &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\"><u>Buy now</u></a>.&nbsp; &nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\"><u>802-523-2202</u></a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp; &nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\"><u>1-800-621-MTNS</u></a> or email <a href=\"mailto:seasonpass@killington.com\"><u>seasonpass@killington.com</u></a>&nbsp; &nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\"><u>Killington.com/cancellation</u></a> for more details on our cancellation policy.&nbsp; &nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp; &nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp; &nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it </strong><a href=\"https://form.jotform.com/243283973021051\"><strong><u>here.</u></strong></a>&nbsp;</p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1771024593,
    "updated": 1771024593,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "a972ab2f-39e9-450e-bc44-f000659fa7a4",
    "name": "Snow Report 2026-02-13 05:49:35",
    "date": "2026-02-13 05:49:35",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Good morning, Beast family!</p><p>The mountain is skiing unbelievably well right now, with another 4 inches stacking up yesterday giving every trail a refresh. We’ve got a killer weekend ahead with beautiful weather, winter games watch parties, and top-tier turns all coming together for an unmatched scene. Vertigo Headwall came online yesterday, pushing us to 100% open and keeping us leading the East in shredable terrain.</p><p>Today is shaping up to be a bluebird beauty. Expect mostly sunny skies with temps topping out around 21° at the base and 14° up top. A steady west wind will keep things feeling a bit chillier but don’t worry, the sunshine will make those turns feel that much sweeter.</p><p>The snow surfaces have been delivering the goods recently with soft turns and super fun packed powder all over. There are still powder stashes to be found and our groomers have been perfect for laying down deep arcs. Check out Needles Eye for that nice packed powder or Stitch Line for something more challenging that has been skiing and riding really well. Another classic option is Superstar, which has fun snow if you aren’t afraid to ski under the guns. Just remember that when the temps creep up a little closer to 30°, the snow from our low-energy snowguns will start grabbing your skis/board a little more, so ski &amp; ride with some caution.</p><p>Our grooming team laid down corduroy on many of the same trails and switched it up a little by adding Downdraft, Pipe Dream, Old Superstar, Sassafras, and Outer Limits. Get over to Cruise Control for nice morning carves or to Outer Limits if you're craving a steeper pitch. By midday, expect groomed terrain to ski soft and playful, while ungroomed trails, trees, and bumps stay filled in and smooth thanks to another natural refresh.&nbsp;</p><p>Our snowmaking crew changed gears yesterday and got the guns firing on Devil's Fiddle. They'll also keep things running on Superstar, Skyelark, and Mouse Trap and stick to this plan until Sunday. After spreading efforts across key terrain and refreshing surfaces, they have pulled off a lot of work to get things going on Devil's Fiddle. It’s rare to see that trail get action, so shout out to our crews for making it happen. While others start winding things down, The Beast keeps the throttle down, charging ahead and leading the pack in snowmaking firepower. Interested to know why making snow has been doubly hard this season even though it’s been so cold? Check out our latest <a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride. In our Vale Yard Park, we're still rocking the Park Affair build from last weekend, featuring 9 features and jumps in total from XS to M difficulty.</p><p>If&nbsp;you’ve&nbsp;reserved&nbsp;<a href=\"https://www.killington.com/lessons-rentals/rentals/winter-rentals/\">rentals</a>&nbsp;or&nbsp;<a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">demo gear</a>&nbsp;ahead of this weekend, save yourself some time on Saturday morning by picking them up from our Snowshed Lodge any time between 2:00 p.m. and 9:00 p.m. today, February 13th. Also, the Bear Mountain Quad is slated to&nbsp;open up&nbsp;at 7:30 a.m. once again this Saturday.</p><p>Our first of two winter games&nbsp;watch&nbsp;parties this weekend will take place on the K-1 Lodge patio. All day on Saturday, February 14th and Sunday, February 15th,&nbsp;you’re&nbsp;invited to join us at our&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">Winter Olympic Games Milano Cortina 2026 Watch Party</a>, proudly sponsored by the Official&nbsp;Team USA&nbsp;Beer Sponsor, Michelob ULTRA. Coverage of the winter games will be playing all day long on TV screens just outside the lodge, with special Michelob ULTRA activations taking place during the USA Men’s Hockey games at 3:00 p.m. on both Saturday and Sunday.</p><p>On Sunday morning,&nbsp;we’re hosting a <a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">watch party for Mikaela Shiffrin&nbsp;</a>during her Women’s&nbsp;Giant Slalom run on the 3rd floor of our K-1 Lodge. We added a limited number of additional tickets last night, but if you miss out, you can still&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\">bid here</a>&nbsp;for exclusive Mikaela Shiffrin auction items,&nbsp;with all proceeds&nbsp;benefitting&nbsp;the Share Winter Foundation.</p><p>To help with parking this weekend, the <a href=\"https://mtn-goat.com/\">Mountain G.O.A.T.</a> will offer complimentary shuttle services (as available) around our K-1, Ramshead, and Snowshed base areas this Saturday and Sunday. We will also be offering our regularly scheduled <a href=\"https://www.killington.com/the-mountain/getting-here/base-area-parking/\">Base Area Transportation Shuttles</a> all throughout the weekend.</p><p>Get ready for a banger weekend!</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 94</strong></p><p><em>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.</em>&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp;&nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\">here</a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LDQAIa4zAaGaZ3MU27yJLHYA&amp;gclid=Cj0KCQiA0KrJBhCOARIsAGIy9wBkhpCy6BBy_e2MaPkSU7MI_kHWTBJN28YVRYSNxAb0SFkTbM35YX0aAosdEALw_wcB\">here</a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge&nbsp;</strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp;&nbsp;</li></ul><p><strong>Snowshed Lodge&nbsp;</strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">Click here</a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\">here</a>.&nbsp;&nbsp;</li></ul><p><strong>Ramshead Lodge&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp;&nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\">Ministars</a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp;&nbsp;</li></ul><p><strong>Bear Mountain&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp;&nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp;&nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp;&nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp;&nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp;&nbsp;</p><p><strong>Ledgewood Yurt –&nbsp;</strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\">Reservations</a> recommended.&nbsp;&nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong>Killington Sports</strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp;&nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;</p><p>&nbsp;&nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\">Killington Lift Tickets</a>.&nbsp;&nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\">Online Pass Checker</a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\">here</a>.  &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\">Buy now</a>.&nbsp;&nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\">802-523-2202</a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp;&nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\">1-800-621-MTNS</a> or email <a href=\"mailto:seasonpass@killington.com\">seasonpass@killington.com</a>&nbsp;&nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\">Killington.com/cancellation</a> for more details on our cancellation policy.&nbsp;&nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp;&nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp;&nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it&nbsp;</strong><a href=\"https://form.jotform.com/243283973021051\"><strong>here.</strong></a></p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1770980489,
    "updated": 1771022705,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "6841670c-47bc-49e1-9df1-2a23435318f2",
    "name": "Snow Report 2026-02-12 16:32:37",
    "date": "2026-02-12 16:32:37",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Evening, Beast family,</p><p>The mountain is skiing unbelievably well right now, with another 4 inches stacking up overnight giving every trail a refresh. We’ve got a killer weekend ahead with beautiful weather, Olympic watch parties, and top-tier turns all coming together for an unmatched scene. Vertigo Headwall came online today, pushing us to 100% open and keeping us leading the East in shredable terrain.</p><p>Friday is shaping up to be a bluebird beauty. Expect mostly sunny skies with temps topping out around 21° at the base and 14° up top. A steady west wind will keep things feeling a bit chillier but don’t worry, the sunshine will make those turns feel that much sweeter.</p><p>The snow surfaces have been delivering the goods recently with soft turns and super fun packed powder all over. There are still powder stashes to be found and our groomers have been perfect for laying down deep arcs. Check out Needles Eye for that nice packed powder or Stitch Line for something more challenging that has been skiing and riding really well. Another great option is Superstar which has fun snow if you aren’t afraid to ski under the guns.&nbsp;</p><p>Our grooming team will be laying down corduroy on many of the same trails and switching it up a little by adding Downdraft, Pipe Dream, Old Superstar, Sassafras, and Outer Limits. Get over to Cruise Control for nice morning carves or to Outer Limits if you're craving a steeper pitch. By midday, expect groomed terrain to ski soft and playful, while ungroomed trails, trees, and bumps stay filled in and smooth thanks to another natural refresh.&nbsp;</p><p>Our snowmaking crews switched gears today and got the guns firing on Devils Fiddle. They'll keep things running on Superstar, Skyehawk, and Mouse Trap and stick to this plan until Sunday. After spreading efforts across key terrain and refreshing surfaces, they have pulled off a lot of work to get things going on Devils Fiddle. It’s rare to see that trail get action so shoutout to our crews for making it happen. While others start winding things down, The Beast keeps the throttle down, charging ahead and leading the pack in snowmaking firepower. If you want to learn more about our snowmaking, check out the <a href=\"https://www.killington.com/the-mountain/sustainability-community/insider-blog/snowmaking-during-an-extended-cold-front/\">Insider Blog</a>.&nbsp;</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride.</p><p>If&nbsp;you’ve&nbsp;reserved&nbsp;<a href=\"https://www.killington.com/lessons-rentals/rentals/winter-rentals/\">rentals</a>&nbsp;or&nbsp;<a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">demo gear</a>&nbsp;ahead of this weekend, save yourself some time on Saturday morning by picking them up from our Snowshed Lodge any time between 2:00 p.m. and 9:00 p.m. on Friday, February 13th. Also, the Bear Mountain Quad is slated to&nbsp;open up&nbsp;at 7:30 a.m. once again this Saturday.</p><p>Our first of two winter games&nbsp;watch&nbsp;parties this weekend will take place on the K-1 Lodge patio. All day on Saturday, February 14th and Sunday, February 15th,&nbsp;you’re&nbsp;invited to join us at our&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">Winter Olympic Games Milano Cortina 2026 Watch Party</a>, proudly sponsored by the Official&nbsp;Team USA&nbsp;Beer Sponsor, Michelob ULTRA. Coverage of the winter games will be playing all day long on TV screens just outside the lodge, with special Michelob ULTRA activations taking place during the USA Men’s Hockey games at 3:00 p.m. on both Saturday and Sunday.</p><p>On Sunday morning,&nbsp;we’re hosting a <a href=\"https://www.killington.com/things-to-do/events/events-calendar/winter-olympic-watch-party/\">watch party for Mikaela Shiffrin&nbsp;</a>during her Women’s&nbsp;Giant Slalom run on the 3rd floor of our K-1 Lodge. We’ve added 60 more tickets but if you miss out, you can still&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\">bid here</a>&nbsp;for exclusive Mikaela Shiffrin auction items,&nbsp;with all proceeds&nbsp;benefitting&nbsp;the Share Winter Foundation.</p><p>To help with parking this weekend, the <a href=\"https://mtn-goat.com/\">Mountain G.O.A.T.</a> will offer complimentary shuttle services (as available), from their lot at 2134 Killington Road to our K-1, Ramshead, and Snowshed base areas this Saturday and Sunday. We will also be offering our regularly scheduled <a href=\"https://www.killington.com/the-mountain/getting-here/base-area-parking/\">Base Area Transportation Shuttles</a> all throughout the weekend.</p><p>Get ready for a banger weekend!</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 94</strong></p><p>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp;&nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\">here</a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LDQAIa4zAaGaZ3MU27yJLHYA&amp;gclid=Cj0KCQiA0KrJBhCOARIsAGIy9wBkhpCy6BBy_e2MaPkSU7MI_kHWTBJN28YVRYSNxAb0SFkTbM35YX0aAosdEALw_wcB\">here</a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge&nbsp;</strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp;&nbsp;</li></ul><p><strong>Snowshed Lodge&nbsp;</strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">Click here</a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\">here</a>.&nbsp;&nbsp;</li></ul><p><strong>Ramshead Lodge&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp;&nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\">Ministars</a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp;&nbsp;</li></ul><p><strong>Bear Mountain&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp;&nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp;&nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp;&nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp;&nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp;&nbsp;</p><p><strong>Ledgewood Yurt –&nbsp;</strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\">Reservations</a> recommended.&nbsp;&nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong>Killington Sports</strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp;&nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;</p><p>&nbsp;&nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\">Killington Lift Tickets</a>.&nbsp;&nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\">Online Pass Checker</a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\">here</a>.  &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\">Buy now</a>.&nbsp;&nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\">802-523-2202</a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp;&nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\">1-800-621-MTNS</a> or email <a href=\"mailto:seasonpass@killington.com\">seasonpass@killington.com</a>&nbsp;&nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\">Killington.com/cancellation</a> for more details on our cancellation policy.&nbsp;&nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp;&nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp;&nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it&nbsp;</strong><a href=\"https://form.jotform.com/243283973021051\"><strong>here.</strong></a></p>",
    "amount": 0,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1770932398,
    "updated": 1770932398,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  },
  {
    "id": "57c9099b-de3d-47ee-9177-98aa8caf6775",
    "name": "Snow Report 2026-02-12 09:38:31",
    "date": "2026-02-12 09:38:31",
    "location": {
      "uuid": "749c96d9-17a6-46ca-9082-a5c5ba141230",
      "name": "Primary"
    },
    "report": "<p>Good morning, Beast fans,</p><p>We are officially 100% open with the most terrain in the East and it's skiing and riding pretty darn good! We picked up another 4 inches of fresh last night on top of the 4 inches of thick powder yesterday, and the mountain is nicely filled in with soft turns waiting all over the place. Today, mostly cloudy skies will hang around, with a high near 13 degrees and Northwest winds around 26 mph will keep things feeling chillier at times. It’s going to be classic midwinter energy on display.</p><p>We’ve got a lot to look forward to as snow surfaces are leveling up. With recent dry packed powder, the new snow we picked up will layer soft turns on top of an already solid base. Expect more powder stashes on natural terrain and a smooth, creamy ride on just about everything else.</p><p>Our grooming team rolled with a similar game plan, touching up many of your favorite cruisers and laying down fresh corduroy with a little less on the list as we let that new snow shine. Yodeler, rarely groomed and always a treat, will be a great option for beginners looking for a confidence boost. Header sets up as a mellow intermediate cruise with fresh cord waiting to be carved, and Cascade will be the steeper, leg burning groomer for expert skiers and riders who like to open it up. By midday, expect groomed terrain to ski soft and playful, while ungroomed trails, trees, and bumps stay filled in and smooth thanks to that natural refresh. In short, it is all going to be good.&nbsp;</p><p>Snowmaking is staying full throttle, blasting 210 snowguns recently as we continue our push for the longest season in the East. We ran a similar game plan last night, focusing efforts on Vertigo Headwall, Superstar top to bottom, Upper Skyelark, and Bittersweet, with Lower Bunny Buster getting some love tonight. The crew has been spread strong across key terrain to keep rebuilding and refreshing surfaces. After a period of real solid work, they'll be switching gears to pull off everything except Superstar, Skyehawk, and Mouse Trap so that they can focus snowmaking on Devils Fiddle this afternoon! That trail rarely gets to see the guns running, making this a big move by our crews.&nbsp;</p><p>As temps and energy demand cooperate, our team is taking full advantage, rebuilding bases, resurfacing high traffic areas, and setting us up for a strong stretch ahead. Expect variable and potentially wet conditions on trails where guns are firing. While others start winding things down, The Beast keeps charging and leading the way in snowmaking efforts. Huge shoutout to our snowmaking crew for continuing to make big moves this time of year.</p><p>Over in kparks, the lineup remains stacked. Dream Maker is firing with 21 features between the upper and lower sections, The Stash remains fully in play with wooden and stone features plus natural hits in the woods, Timberline continues to shine with 45 features, five jumps, and a halfpipe, Easy Street Progression Park has 10 features, and Lil’ Stash is open with three jumps, a tree jump, and a wall ride.</p><p>On Sunday morning,&nbsp;we’re hosting a watch party for Mikaela Shiffrin&nbsp;during her Women’s&nbsp;Giant Slalom run. Though tickets have sold out, you can still&nbsp;<a href=\"https://www.killington.com/things-to-do/events/events-calendar/mikaela-watch-party/\"><u>bid here</u></a>&nbsp;for exclusive Mikaela Shiffrin auction items,&nbsp;with all proceeds&nbsp;benefitting&nbsp;the Share Winter Foundation.</p><p>It’s prime mid-winter on the slopes. Don’t miss it!</p><p>– Evan</p><p>&nbsp;</p><p><strong>Operating Day: 93</strong></p><p>Upcoming blackout dates for Ikon Base and Ikon Session Passes are as follows: Feb 14-15, 2026.&nbsp;</p><p><strong><u>Lifts</u></strong>&nbsp;</p><p>Key lifts operate seven days a week from 9:00 a.m. to 4:00 p.m. on Monday through Friday, and from 8:00 a.m. to 4:00 p.m. on Saturday and Sunday plus Peak Dates*; the Bear Mountain Quad will operate from 7:30 a.m. to 4:00 p.m. every Saturday through the end of March.</p><p>The North Ridge Quad will open at 9:30 a.m. on weekdays and 8:00 a.m. on weekends, the Canyon Quad will spin from 10:00 a.m. to 3:30 p.m. Monday, Wednesday, Friday and 9:00 a.m. to 4:00 p.m. on weekends, and the Sunrise Village Triple will spin until 3:00 p.m. on weekdays and 4:00 p.m. on weekends.&nbsp;</p><p><em>A note for our snowboarders:</em> Thanks to our new cabins on the Skyeship Gondola, we're asking you to please utilize the snowboard racks outside of each cabin. If the racks are entirely full, please put your boards underneath the seats. This differs from our K-1 Gondola, where all snowboards should be brought inside the cabins. Just remember: outside Skyeship, inside K-1!&nbsp;</p><p><strong><u>Uphill Travel</u></strong>&nbsp;</p><ul><li>Ramshead base to top of Ramshead Express Quad - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Ramshead Express Quad to top of Snowdon Mountain - <strong>Open</strong></li><li>Snowshed base to the top of Snowshed Slope - <strong>Open</strong>&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Base of Sunrise Village Triple to top of Bear Mountain - <strong>Open</strong></li><li>Killington/Pico Mountain Interconnect - <strong>Open</strong></li><li>Pico Base to the top of Golden Express Quad - <strong>Open</strong></li><li>Pico Base to Pico Summit - <strong>Open</strong></li><li>Pico Summit Glade Route - <strong>Open</strong>&nbsp;&nbsp;</li></ul><p>All uphill travelers are required to have an Uphill Travel Pass and armband, which can be picked up at any ticket window. Before heading up the hill, be sure to review our uphill travel policies and grab your pass <a href=\"https://www.killington.com/tickets-passes/season-passes/uphill-pass/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LD8u8g9JSI7ZkOegTbD-2cbB&amp;gclid=Cj0KCQiAosrJBhD0ARIsAHebCNoWh0vwkwsArWHOMRE8CuwERTkksX7GL4ZtW8swthZaTG7RNKCYRWwaAn11EALw_wcB\">here</a>. Please keep an eye out for grooming equipment and steer clear of mountain ops during non-operating hours.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><u>Mountain Services</u></strong>&nbsp;</p><p><strong>Parking</strong> is available at the K-1, Snowshed, Ramshead, Bear, Skyeship and Vale parking lots. Please respect signage and allow our parking staff to assist you on your trip to the slopes. Shuttle service is available from 7:00 a.m. - 5:00 p.m. midweek and 6:00 a.m. - 5:00 p.m. on weekends and holidays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p>Winter car camping and overnight parking is only available at Skyeship. See details <a href=\"https://www.killington.com/things-to-do/shopping-amenities/camping/?gclsrc=aw.ds&amp;&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_content=pmax&amp;gad_source=1&amp;gad_campaignid=23052461704&amp;gbraid=0AAAAACPa8LDQAIa4zAaGaZ3MU27yJLHYA&amp;gclid=Cj0KCQiA0KrJBhCOARIsAGIy9wBkhpCy6BBy_e2MaPkSU7MI_kHWTBJN28YVRYSNxAb0SFkTbM35YX0aAosdEALw_wcB\">here</a>.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong>K-1 Lodge&nbsp;</strong>– Open from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>Breakfast will be served starting at 7:30 a.m. on Sat. &amp; Sun. and at 8:30 a.m. Mon. - Fri. Lunch will be served 10:30 a.m. - 3:30 p.m. 7 days a week. The K-1 Pub (3rd floor) will be open at 10:00 a.m. 7 days a week and the Brew Bar (2nd floor) will be open starting at 9:00 a.m. on Fridays - Sundays until further notice.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Rentals, Killington Sports at K-1, and Guest Services (2nd floor) will be open 30 minutes before and after lifts.</li><li>Guest Services are also available 7 days a week from the K-1 ticket counter on the 1st floor. This location closes at 1:00 p.m. on Mon-Thurs and at 4:30 p.m. on Fri-Sat on a weekly basis, with the exception of peak periods.&nbsp;&nbsp;</li></ul><p><strong>Snowshed Lodge&nbsp;</strong>- Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</p><ul><li>The Snowshed Food Court serves breakfast starting 30 minutes before lifts open and serves lunch from 10:30 a.m. to 3:30 p.m. daily.</li><li>The Long Trail Pub is open daily from 10:30 a.m. - 6:00 p.m., offering our Lunch Dining Menu until 5:30 p.m. and lite fare until 6:00 p.m.</li><li>Rentals, Killington Sports at Snowshed, and Guest Services (at the Snowshed ticket windows) will be open 30 minutes before and after lifts. On Fridays, rentals for the weekend can be picked up ahead of time between 2:00 p.m. and 9:00 p.m.</li><li>Snowshed Demos &amp; Tuning is open for your demo and tuning needs! Ski and snowboard rentals are now available. Please note that binding mounts &amp; adjustments are not offered at this time. Open 30 minutes before and after lifts. <a href=\"https://www.killington.com/lessons-rentals/rentals/demos-repair-center/\">Click here</a> for more information.</li><li>Private and group lessons are available and are booked online in advance <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/lessons/\">here</a>.&nbsp;&nbsp;</li></ul><p><strong>Ramshead Lodge&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp;&nbsp;</p><ul><li>The Ramshead Food Court is open daily with grab &amp; go options &amp; soups. The pizza station is open Thursdays - Mondays, and the full grill menu is available Fridays - Sundays.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services are available 7 days a week, open 30 minutes before lifts open at the Ramshead ticket windows. Guest Services closes at 12:00 p.m. on Monday - Thursday and at 4:30 p.m. on Friday - Sunday.</li><li>Rentals at Ramshead are open for youth lesson participants and families only.</li><li>Youth Group Lessons and our <a href=\"https://www.killington.com/lessons-rentals/ski-snowboard-lessons/youth-lesson/ministars/\">Ministars</a> program meet at Ramshead.</li><li>Child Care Center at Ramshead is open Monday - Friday from 8:30 a.m. - 3:45 p.m. and on weekends from 8:00 a.m. - 3:45 p.m.&nbsp;&nbsp;</li></ul><p><strong>Bear Mountain&nbsp;</strong>– Open daily from 8:00 a.m. - 5:00 p.m. on weekdays and 7:00 a.m. - 5:00 p.m. on weekends.&nbsp;&nbsp;</p><ul><li>The Bear Mountain Food Court is open daily with breakfast served 30 minutes before lifts, plus grab &amp; go items and soups available. Full grill menu available Friday – Sunday. Bear Bar is open until 4:30 p.m. On Mon. - Fri. and until 5:00 p.m. on weekends.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;</li><li>Guest Services available Fri. – Mon. at ticket windows. Open 30 minutes before lifts start spinning. Kiosk ticket pickup is available daily.&nbsp;&nbsp;</li></ul><p><strong>Peak Lodge</strong> <strong>–</strong> Open daily from 9:30 a.m. - 3:30 p.m. Grill open 10:30 a.m. - 3:00 p.m., 7 days a week. The Peak Lodge Bar will now be offering its own menu seven days a week.&nbsp;&nbsp;</p><p><strong>Skyeship Lodge –</strong> Open daily with Guest Services, food, and bar service at the Rollin' Rooster daily.&nbsp;&nbsp;</p><p><strong>Jerk Jamaican Mountain Grill –</strong> Open Thursday-Monday from 10:30 a.m. - 3:00 p.m., weather permitting.&nbsp;&nbsp;</p><p><strong>Ledgewood Yurt –&nbsp;</strong>Open Thur. - Mon. from 10:30 a.m. to 3:00 p.m. <a href=\"https://www.killington.com/things-to-do/dining-apres/resort-dining/yurt/\">Reservations</a> recommended.&nbsp;&nbsp;</p><p><a href=\"https://killingtonsports.com/?gad_source=1&amp;gclid=EAIaIQobChMIw_eb8OvFiQMVOG1HAR0vkS9jEAAYASAAEgIBVfD_BwE\"><strong>Killington Sports</strong></a> at Route 4 is open Sunday - Thursday from 10:00 a.m. - 5:00 p.m., Friday and Saturday from 10:00 a.m. - 6:00 p.m., and 10:00 a.m. - 4:00 p.m. on holidays.&nbsp;&nbsp;</p><p><em>Mountain services are subject to change. Please check here daily before making your lunch and lodge choices.</em>&nbsp;</p><p>&nbsp;&nbsp;</p><p><strong>Winter Lift Tickets and rentals must be purchased online at</strong> <a href=\"https://www.killington.com/tickets-passes/winter-tickets/lift-ticket/\">Killington Lift Tickets</a>.&nbsp;&nbsp;</p><p>Check to see if your pass is good to go using our <a href=\"https://account.killington.com/pass-checker\">Online Pass Checker</a>. Find Season Pass FAQs by clicking <a href=\"https://www.killington.com/tickets-passes/season-passes/passes#faq\">here</a>.  &nbsp;</p><p>Get your Unlimited Winter Season Pass today! <a href=\"https://www.killington.com/tickets-passes/season-passes/passes/\">Buy now</a>.&nbsp;&nbsp;</p><p>Have a ticketing question? Our text number (<a href=\"tel:8025232202\">802-523-2202</a>) is the best way to get it answered quickly, but please note that we cannot process transactions via text.&nbsp;&nbsp;</p><p>Have a season pass question? Call <a href=\"tel:8006216867\">1-800-621-MTNS</a> or email <a href=\"mailto:seasonpass@killington.com\">seasonpass@killington.com</a>&nbsp;&nbsp;</p><p>Please visit <a href=\"https://www.killington.com/cancellation/\">Killington.com/cancellation</a> for more details on our cancellation policy.&nbsp;&nbsp;</p><p>Killington is a cashless resort. We accept all major credit cards as well as Apple, Google, and Samsung Pay.&nbsp;&nbsp;</p><p>*Winter 2025/26 Peak Dates with 8:00 a.m. openings: February 14 - 16, 2026&nbsp;&nbsp;</p><p><strong>We strive to have the most up-to-date and accurate snow report, but errors can happen from time to time. If you have feedback or a correction for us, please share it&nbsp;</strong><a href=\"https://form.jotform.com/243283973021051\"><strong>here.</strong></a></p>",
    "amount": 2,
    "overnight_amount": 0,
    "base_depth": 27,
    "unit_of_measurement": "in",
    "author": {
      "name": "",
      "image": ""
    },
    "created": 1770907155,
    "updated": 1770908824,
    "computed": {
      "24_hour": 0,
      "48_hour": 0,
      "72_hour": 0,
      "7_day": 8,
      "30_day": 53,
      "month": 17,
      "total": 157
    }
  }
]